[
  {
    "id": 1,
    "title": "Term Life Insurance",
    "slug": "term-life-insurance",
    "description": "Traditional Term Life Insurance - One of the most affordable types of life insurance, term life insurance provides you with coverage during the years you need it most (i.e. your selected \"term\"). It can be appropriate for those who may have a greater need for coverage now that may diminish over time. Maybe you're starting a family and want peace of mind that they would be financially protected if you were no longer here. Or you've just closed on a new home with your spouse — and want greater coverage until your mortgage is paid off. Term Life Insurance allows you to decide how long you'll need coverage (between 10 to 30 years). It's your life — shouldn't your policy duration be on your terms, too?"
  },
  {
    "id": 2,
    "title": "Quality of Life... Insurance",
    "slug": "quality-of-life-insurance",
    "description": "Term Life Insurance with Living Benefits - Quality of Life... Insurance® is a term life insurance policy that offers new and innovative benefits that you won't find in most other policies. Much like traditional term life insurance policies, Quality of Life... Insurance® can help to provide your loved ones with financial protection if you pass away. But it can also provide you with living benefits during your lifetime — when you may need them the most. These \"living benefits\" are available to those who have a qualifying chronic, critical or terminal illness. It can help to cover expenses, such as medical bills. By lifting some of the financial responsibility off of the shoulders of your loved ones, they'll be free to focus on what matters most — sharing a laugh or a meal with you."
  },
  {
    "id": 3,
    "title": "Permanent Life Insurance",
    "slug": "permanent-life-insurance",
    "description": "Permanent Life Insurance refers to a variety of life insurance products intended to provide you and your loved ones with life-long protection. All of these permanent life insurance types are designed to cover you until your death, like Universal Life Insurance or Whole life insurance. Permanent Life Insurance can help provide lifelong protection, and can typically provide the ability to accumulate cash value on a tax-deferred basis (similar to earned taxable income being deferred within your 401k retirement plan), and the cash value can be used in the future for any purpose you wish. Unlike term insurance which ends at the end of the defined term length, a Permanent Life Insurance policy will remain active (or in-force) for as long as you continue to pay your premiums."
  },
  {
    "id": 4,
    "title": "Universal Life Insurance",
    "slug": "universal-life-insurance",
    "description": " type of whole life insurance, our Universal Life Insurance policy also offers coverage for up to a lifetime. But there's one key difference between traditional whole life insurance policies and universal life: flexibility. Universal Life Insurance lets you adjust the benefit amount to meet your current needs — subject to approval by the life insurance provider — without having to buy a new policy. It can be appropriate for those who are just starting out in life, whether you've just landed your first job or moved into your first apartment. Your financial situation may change over time — and you need a policy that can change along with it."
  },
  {
    "id": 5,
    "title": "Whole Life Insurance",
    "slug": "whole-life-insurance",
    "description": "Whole life insurance is coverage with no expiration date. That means you can buy coverage now and keep it for up to a lifetime. What else can you get that will last for a lifetime? The same \"premium rate,\" which is the amount you pay for your policy. So if you buy a policy during your working years, you'll pay the same amount for it during your retirement years. Plus, with each payment you make, money will be set aside, like a nest egg for the future.<br />There are two types of whole life insurance policies offered through AIG Direct: Universal Life Insurance and Guaranteed Issue Whole Life Insurance."
  },
  {
    "id": 6,
    "slug": "guaranteed-issue-whole-life-insurance",
    "title": "Guaranteed Issue Whole Life Insurance",
    "description": "Another type of whole life insurance, Guaranteed Issue Whole Life Insurance is designed just for those ages 50 to 80 years old. If you meet the age requirement, you can't be turned down for health reasons — you're guaranteed approval. You can also skip the medical exam and the health questionnaire, which are requirements for other types of life insurance. For those who qualify, it a good way to find the coverage you need without the hassle you don't."
  },
  {
    "id": 7,
    "title": "Accidental Death Insurance",
    "slug": "accidental-death-insurance",
    "description": "Accidents are, unfortunately, part of life. While you can't prevent them, you can prepare. That's why AIG Direct offers Accidental Death and Dismemberment Insurance (AD&D), which can help cover you and your family should you become seriously injured or killed in an accident, lose a limb, suffer from blindness, or become paralyzed in a covered accident. Although it's not a life insurance policy, it can provide protection for those who might have otherwise gone without. It's also less expensive than a term or whole life insurance policy — and you don't have to take a medical exam to qualify for the same amount of coverage."
  }
]
